In [31]:
import pandas as pd
    
df = pd.DataFrame({
        'country': ['India','US', 'Japan', 'US', 'Japan'],
        'age': [44, 34, 46, 35, 23],
        'salary': [72000, 65000, 98000, 4500, 34000]
    })
df

  country  age  salary
0   India   44   72000
1      US   34   65000
2   Japan   46   98000
3      US   35    4500
4   Japan   23   34000

In [28]:
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()
df['country'] = label_encoder.fit_transform(df['country'])
df

   country  age  salary
0        0   44   72000
1        2   34   65000
2        1   46   98000
3        2   35    4500
4        1   23   34000

In [29]:
label_encoder.classes_

array(['India', 'Japan', 'US'], dtype=object)

In [32]:
x = df['country'].values.reshape(-1,1)
x

array([['India'],
       ['US'],
       ['Japan'],
       ['US'],
       ['Japan']], dtype=object)

In [33]:
from sklearn.preprocessing import OneHotEncoder

onehot_encoder = OneHotEncoder()
x = onehot_encoder.fit_transform(x).toarray()
x

array([[1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 1., 0.]])

In [34]:
onehot_encoder.categories_

[array(['India', 'Japan', 'US'], dtype=object)]

In [38]:
df_onehot = pd.DataFrame(x, columns=[str(i) for i in range(x.shape[1])])
df_onehot

     0    1    2
0  1.0  0.0  0.0
1  0.0  0.0  1.0
2  0.0  1.0  0.0
3  0.0  0.0  1.0
4  0.0  1.0  0.0

In [39]:
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()
df['country'] = label_encoder.fit_transform(df['country'])
df

   country  age  salary
0        0   44   72000
1        2   34   65000
2        1   46   98000
3        2   35    4500
4        1   23   34000

In [41]:
df = pd.concat([df_onehot, df], axis=1)
df

     0    1    2  country  age  salary
0  1.0  0.0  0.0        0   44   72000
1  0.0  0.0  1.0        2   34   65000
2  0.0  1.0  0.0        1   46   98000
3  0.0  0.0  1.0        2   35    4500
4  0.0  1.0  0.0        1   23   34000